package com.li.inspection.constant;

/**
 * Created by long on 17-1-12.
 */

public class Constants {
    public static final String TAG = "Tag";
    public static String judea[] = {"车辆识别代号","发动机型号/号码","车辆品牌/型号","车身颜色","核定载人数","车辆类型","号牌/车辆外观形状","轮胎完好情况"};
    public static String judeb[] = {"安全带/三角警告牌","外廓尺寸/轴数/轴距","整备质量","轮胎规格","侧后部防护装置","车身反光标识/尾部标志板/喷涂","灭火器","行驶记录装置/车内录像监控装置","应急出口/应急锤/乘客门","外部标识/文字/喷漆","标志灯具/警报器","检验合格证明","整体检验结论"};
    public static String Gps = "";
    public static String USE_PROPERTY[] = {"01 非营运", "02 公路客运","03 公交客运","04 货运","04 其他营运","04 其他非营运"};
    public static String PLATE_TYPE[] = {"01 小型汽车号牌","02 大型汽车号牌", "03 低速车号牌","04 普通摩托车号牌",
            "05 挂车号牌"};
    public static String SERVICE_TYPE[] = {"A 注册登记", "B 转移登记","C 变更迁出","D 变更车身颜色",
            "E 更换车身或者车架","F 更换整车","G 更换发动机","H 重新打刻发动机号","I 转入","J 变更使用性质",
            "K 重新打刻VIN","L 加装/拆除操纵辅助装置","M 申领登记证书","N 补领登记证书","O 监督解体","P 其他",};
    public static String VEHICLE_TYPE[] = {"K1 重型普通半挂车", "K2 重型厢式半挂车", "K3 重型罐式半挂车",
            "K4 重型平板半挂车", "K5 重型集装箱半挂车", "K6 重型自卸半挂车", "K7 重型特殊结构半挂车",
            "K8 重型仓栅式半挂车", "K9 重型旅居半挂车", "K10 重型专项作业半挂车", "K11 重型低平板半挂车",
            "K12 中型普通半挂车", "K13 中型厢式半挂车", "K14 中型罐式半挂车", "K15 中型平板半挂车",
            "K16 中型集装箱半挂车", "K17 中型自卸半挂车", "K18 中型特殊结构半挂车", "K19 中型仓栅式半挂车",
            "K20 中型旅居半挂车", "K21 中型专项作业半挂车", "K22 中型低平板半挂车", "K23 轻型普通半挂车",
            "K24 轻型厢式半挂车", "K25 轻型罐式半挂车", "K26 轻型平板半挂车", "K27 轻型自卸半挂车",
            "K28 轻型仓栅式半挂车", "K29 轻型旅居半挂车", "K30 轻型专项作业半挂车", "K31 轻型低平板半挂车",
            "K32 无轨电车", "K33 有轨电车", "K34 重型普通全挂车", "K35 重型厢式全挂车", "K36 重型罐式全挂车",
            "K37 重型平板全挂车", "K38 重型集装箱全挂车", "K39 重型自卸全挂车", "K40 重型仓栅式全挂车",
            "K41 重型旅居全挂车", "K42 重型专项作业全挂车", "K43 中型普通全挂车", "K44 中型厢式全挂车",
            "K45 中型罐式全挂车", "K46 中型平板全挂车", "K47 中型集装箱全挂车", "K48 中型自卸全挂车",
            "K49 中型仓栅式全挂车", "K50 中型旅居全挂车", "K51 中型专项作业全挂车", "K52 轻型普通全挂车",
            "K53 轻型厢式全挂车", "K54 轻型罐式全挂车", "K55 轻型平板全挂车", "K56 轻型自卸全挂车",
            "K57 轻型仓栅式全挂车", "K58 轻型旅居全挂车", "K59 轻型专项作业全挂车", "K60 重型普通货车",
            "K61 重型厢式货车", "K62 重型封闭货车", "K63 重型罐式货车", "K64 重型平板货车", "K65 重型集装厢车",
            "K66 重型自卸货车", "K67 重型特殊结构货车", "K68 重型仓栅式货车", "K69 中型普通货车",
            "K70 中型厢式货车", "K71 中型封闭货车", "K72 中型罐式货车", "K73 中型平板货车", "K74 中型集装厢车",
            "K75 中型自卸货车", "K76 中型特殊结构货车", "K77 中型仓栅式货车", "K78 轻型普通货车", "K79 轻型厢式货车",
            "K80 轻型封闭货车", "K81 轻型罐式货车", "K82 轻型平板货车", "K83 轻型自卸货车", "K84 轻型特殊结构货车",
            "K85 轻型仓栅式货车", "K86 微型普通货车", "K87 微型厢式货车", "K88 微型封闭货车", "K89 微型罐式货车",
            "K90 微型自卸货车", "K91 微型特殊结构货车", "K92 微型仓栅式货车", "K93 普通低速货车", "K94 厢式低速货车",
            "K95 罐式低速货车", "K96 自卸低速货车", "K97 仓栅式低速货车", "K98 轮式装载机械", "K99 轮式挖掘机械",
            "K100 轮式平地机械", "K101 大型普通客车", "K102 大型双层客车", "K103 大型卧铺客车", "K104 大型铰接客车",
            "K105 大型越野客车", "K106 大型轿车", "K107 大型专用客车", "K108 中型普通客车", "K109 中型双层客车",
            "K110 中型卧铺客车", "K111 中型铰接客车", "K112 中型越野客车", "K113 中型轿车", "K114 中型专用客车",
            "K115 小型普通客车", "K116 小型越野客车", "K117 小型轿车", "K118 小型专用客车", "K119 小型面包车",
            "K120 微型普通客车", "K121 微型越野客车", "K122 微型轿车", "K123 普通正三轮摩托车", "K124 轻便正三轮摩托车",
            "K125 正三轮载客摩托车", "K126 正三轮载货摩托车", "K127 侧三轮摩托车", "K128 普通二轮摩托车",
            "K129 轻便二轮摩托车", "K130 三轮汽车", "K131 重型半挂牵引车", "K132 重型全挂牵引车", "K133 中型半挂牵引车",
            "K134 中型全挂牵引车", "K135 轻型半挂牵引车", "K136 轻型全挂牵引车", "K137 大型轮式拖拉机",
            "K138 小型轮式拖拉机", "K139 手扶拖拉机", "K140 手扶变形运输机", "K141 大型专项作业车", "K142 中型专项作业车",
            "K143 小型专项作业车", "K144 微型专项作业车", "K145 重型专项作业车", "K146 轻型专项作业车"
    };
    public static String VEHICLE_COLOR[] = {"白", "灰", "粉", "黑","红", "黄", "绿", "紫", "蓝", "棕"};
    public static String VEHICLE_PN[] = {"1人", "2人","3人", "4人", "5人", "6人", "7人", "8人", "9人", "10人", "11人", "12人", "13人"};
//    public static String HTTP_PATH = "http://192.168.2.150:8090";
//    public static String HTTP_PATH = "http://192.168.2.226:8099";
    public static String HTTP_PATH = "http://sdkj.kmdns.net:4008";
    public final static String WEBSERVCIE_PATH = "/Inspection/services/TpiWebService?wsdl";
//    public static String UPLOADSERVER = "192.168.2.150";
//    public static String UPLOADSERVER = "192.168.2.226";
    public static String UPLOADSERVER = "sdkj.kmdns.net";
    public static int UPLOADSERVERPORT = 4009;
//    public static int UPLOADSERVERPORT = 8821;
    public static String BITMAPDATA = "邢台县交警大队车管所";

    public static final String[] upData = {"clsbdh", "fdjxx", "clpp", "csys", "hdzrs", "cllx", "hpwg", "ltwhqk", "aqdsjjgp", "wkzszj", "zbzl", "ltgg", "chbffzz", "fgbzbpt", "mhq", "xsjljk", "yjck", "wbbs", "bzdjjbq", "jyhgzm", "zt"};

}
